// Generated by jextract

package com.icuxika.kv.jextract.glfw;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$439 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$439() {}
    static final StructLayout const$0 = MemoryLayout.structLayout(
        JAVA_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pNext"),
        MemoryLayout.sequenceLayout(32, JAVA_INT).withName("presentMask"),
        JAVA_INT.withName("modes"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkDeviceGroupPresentCapabilitiesKHR");
    static final VarHandle const$1 = constants$439.const$0.varHandle(MemoryLayout.PathElement.groupElement("sType"));
    static final VarHandle const$2 = constants$439.const$0.varHandle(MemoryLayout.PathElement.groupElement("pNext"));
    static final VarHandle const$3 = constants$439.const$0.varHandle(MemoryLayout.PathElement.groupElement("modes"));
    static final StructLayout const$4 = MemoryLayout.structLayout(
        JAVA_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pNext"),
        JAVA_INT.withName("swapchainCount"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pDeviceMasks"),
        JAVA_INT.withName("mode"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkDeviceGroupPresentInfoKHR");
    static final VarHandle const$5 = constants$439.const$4.varHandle(MemoryLayout.PathElement.groupElement("sType"));
}


