// Generated by jextract

package com.icuxika.kv.jextract.glfw;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$889 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$889() {}
    static final VarHandle const$0 = constants$888.const$5.varHandle(MemoryLayout.PathElement.groupElement("accelerationStructureReference"));
    static final UnionLayout const$1 = MemoryLayout.unionLayout(
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(4, JAVA_FLOAT)).withName("matrix")
            ).withName("transform"),
            MemoryLayout.paddingLayout(8),
            JAVA_LONG.withName("accelerationStructureReference")
        ).withName("staticInstance"),
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(4, JAVA_FLOAT)).withName("matrix")
            ).withName("transformT0"),
            MemoryLayout.structLayout(
                MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(4, JAVA_FLOAT)).withName("matrix")
            ).withName("transformT1"),
            MemoryLayout.paddingLayout(8),
            JAVA_LONG.withName("accelerationStructureReference")
        ).withName("matrixMotionInstance"),
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                JAVA_FLOAT.withName("sx"),
                JAVA_FLOAT.withName("a"),
                JAVA_FLOAT.withName("b"),
                JAVA_FLOAT.withName("pvx"),
                JAVA_FLOAT.withName("sy"),
                JAVA_FLOAT.withName("c"),
                JAVA_FLOAT.withName("pvy"),
                JAVA_FLOAT.withName("sz"),
                JAVA_FLOAT.withName("pvz"),
                JAVA_FLOAT.withName("qx"),
                JAVA_FLOAT.withName("qy"),
                JAVA_FLOAT.withName("qz"),
                JAVA_FLOAT.withName("qw"),
                JAVA_FLOAT.withName("tx"),
                JAVA_FLOAT.withName("ty"),
                JAVA_FLOAT.withName("tz")
            ).withName("transformT0"),
            MemoryLayout.structLayout(
                JAVA_FLOAT.withName("sx"),
                JAVA_FLOAT.withName("a"),
                JAVA_FLOAT.withName("b"),
                JAVA_FLOAT.withName("pvx"),
                JAVA_FLOAT.withName("sy"),
                JAVA_FLOAT.withName("c"),
                JAVA_FLOAT.withName("pvy"),
                JAVA_FLOAT.withName("sz"),
                JAVA_FLOAT.withName("pvz"),
                JAVA_FLOAT.withName("qx"),
                JAVA_FLOAT.withName("qy"),
                JAVA_FLOAT.withName("qz"),
                JAVA_FLOAT.withName("qw"),
                JAVA_FLOAT.withName("tx"),
                JAVA_FLOAT.withName("ty"),
                JAVA_FLOAT.withName("tz")
            ).withName("transformT1"),
            MemoryLayout.paddingLayout(8),
            JAVA_LONG.withName("accelerationStructureReference")
        ).withName("srtMotionInstance")
    ).withName("VkAccelerationStructureMotionInstanceDataNV");
    static final StructLayout const$2 = MemoryLayout.structLayout(
        JAVA_INT.withName("type"),
        JAVA_INT.withName("flags"),
        MemoryLayout.unionLayout(
            MemoryLayout.structLayout(
                MemoryLayout.structLayout(
                    MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(4, JAVA_FLOAT)).withName("matrix")
                ).withName("transform"),
                MemoryLayout.paddingLayout(8),
                JAVA_LONG.withName("accelerationStructureReference")
            ).withName("staticInstance"),
            MemoryLayout.structLayout(
                MemoryLayout.structLayout(
                    MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(4, JAVA_FLOAT)).withName("matrix")
                ).withName("transformT0"),
                MemoryLayout.structLayout(
                    MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(4, JAVA_FLOAT)).withName("matrix")
                ).withName("transformT1"),
                MemoryLayout.paddingLayout(8),
                JAVA_LONG.withName("accelerationStructureReference")
            ).withName("matrixMotionInstance"),
            MemoryLayout.structLayout(
                MemoryLayout.structLayout(
                    JAVA_FLOAT.withName("sx"),
                    JAVA_FLOAT.withName("a"),
                    JAVA_FLOAT.withName("b"),
                    JAVA_FLOAT.withName("pvx"),
                    JAVA_FLOAT.withName("sy"),
                    JAVA_FLOAT.withName("c"),
                    JAVA_FLOAT.withName("pvy"),
                    JAVA_FLOAT.withName("sz"),
                    JAVA_FLOAT.withName("pvz"),
                    JAVA_FLOAT.withName("qx"),
                    JAVA_FLOAT.withName("qy"),
                    JAVA_FLOAT.withName("qz"),
                    JAVA_FLOAT.withName("qw"),
                    JAVA_FLOAT.withName("tx"),
                    JAVA_FLOAT.withName("ty"),
                    JAVA_FLOAT.withName("tz")
                ).withName("transformT0"),
                MemoryLayout.structLayout(
                    JAVA_FLOAT.withName("sx"),
                    JAVA_FLOAT.withName("a"),
                    JAVA_FLOAT.withName("b"),
                    JAVA_FLOAT.withName("pvx"),
                    JAVA_FLOAT.withName("sy"),
                    JAVA_FLOAT.withName("c"),
                    JAVA_FLOAT.withName("pvy"),
                    JAVA_FLOAT.withName("sz"),
                    JAVA_FLOAT.withName("pvz"),
                    JAVA_FLOAT.withName("qx"),
                    JAVA_FLOAT.withName("qy"),
                    JAVA_FLOAT.withName("qz"),
                    JAVA_FLOAT.withName("qw"),
                    JAVA_FLOAT.withName("tx"),
                    JAVA_FLOAT.withName("ty"),
                    JAVA_FLOAT.withName("tz")
                ).withName("transformT1"),
                MemoryLayout.paddingLayout(8),
                JAVA_LONG.withName("accelerationStructureReference")
            ).withName("srtMotionInstance")
        ).withName("data")
    ).withName("VkAccelerationStructureMotionInstanceNV");
    static final VarHandle const$3 = constants$889.const$2.varHandle(MemoryLayout.PathElement.groupElement("type"));
    static final VarHandle const$4 = constants$889.const$2.varHandle(MemoryLayout.PathElement.groupElement("flags"));
    static final StructLayout const$5 = MemoryLayout.structLayout(
        JAVA_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pNext"),
        JAVA_INT.withName("rayTracingMotionBlur"),
        JAVA_INT.withName("rayTracingMotionBlurPipelineTraceRaysIndirect")
    ).withName("VkPhysicalDeviceRayTracingMotionBlurFeaturesNV");
}


