// Generated by jextract

package com.icuxika.kv.jextract.glfw;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$64 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$64() {}
    static final VarHandle const$0 = constants$63.const$3.varHandle(MemoryLayout.PathElement.groupElement("pBinds"));
    static final StructLayout const$1 = MemoryLayout.structLayout(
        JAVA_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pNext"),
        JAVA_INT.withName("waitSemaphoreCount"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pWaitSemaphores"),
        JAVA_INT.withName("bufferBindCount"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pBufferBinds"),
        JAVA_INT.withName("imageOpaqueBindCount"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pImageOpaqueBinds"),
        JAVA_INT.withName("imageBindCount"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pImageBinds"),
        JAVA_INT.withName("signalSemaphoreCount"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pSignalSemaphores")
    ).withName("VkBindSparseInfo");
    static final VarHandle const$2 = constants$64.const$1.varHandle(MemoryLayout.PathElement.groupElement("sType"));
    static final VarHandle const$3 = constants$64.const$1.varHandle(MemoryLayout.PathElement.groupElement("pNext"));
    static final VarHandle const$4 = constants$64.const$1.varHandle(MemoryLayout.PathElement.groupElement("waitSemaphoreCount"));
    static final VarHandle const$5 = constants$64.const$1.varHandle(MemoryLayout.PathElement.groupElement("pWaitSemaphores"));
}


