// Generated by jextract

package com.icuxika.kv.jextract.glfw;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$724 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$724() {}
    static final VarHandle const$0 = constants$723.const$2.varHandle(MemoryLayout.PathElement.groupElement("numAABBs"));
    static final VarHandle const$1 = constants$723.const$2.varHandle(MemoryLayout.PathElement.groupElement("stride"));
    static final VarHandle const$2 = constants$723.const$2.varHandle(MemoryLayout.PathElement.groupElement("offset"));
    static final StructLayout const$3 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            JAVA_INT.withName("sType"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pNext"),
            RuntimeHelper.POINTER.withName("vertexData"),
            JAVA_LONG.withName("vertexOffset"),
            JAVA_INT.withName("vertexCount"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("vertexStride"),
            JAVA_INT.withName("vertexFormat"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("indexData"),
            JAVA_LONG.withName("indexOffset"),
            JAVA_INT.withName("indexCount"),
            JAVA_INT.withName("indexType"),
            RuntimeHelper.POINTER.withName("transformData"),
            JAVA_LONG.withName("transformOffset")
        ).withName("triangles"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("sType"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pNext"),
            RuntimeHelper.POINTER.withName("aabbData"),
            JAVA_INT.withName("numAABBs"),
            JAVA_INT.withName("stride"),
            JAVA_LONG.withName("offset")
        ).withName("aabbs")
    ).withName("VkGeometryDataNV");
    static final StructLayout const$4 = MemoryLayout.structLayout(
        JAVA_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pNext"),
        JAVA_INT.withName("geometryType"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                JAVA_INT.withName("sType"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pNext"),
                RuntimeHelper.POINTER.withName("vertexData"),
                JAVA_LONG.withName("vertexOffset"),
                JAVA_INT.withName("vertexCount"),
                MemoryLayout.paddingLayout(4),
                JAVA_LONG.withName("vertexStride"),
                JAVA_INT.withName("vertexFormat"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("indexData"),
                JAVA_LONG.withName("indexOffset"),
                JAVA_INT.withName("indexCount"),
                JAVA_INT.withName("indexType"),
                RuntimeHelper.POINTER.withName("transformData"),
                JAVA_LONG.withName("transformOffset")
            ).withName("triangles"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("sType"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pNext"),
                RuntimeHelper.POINTER.withName("aabbData"),
                JAVA_INT.withName("numAABBs"),
                JAVA_INT.withName("stride"),
                JAVA_LONG.withName("offset")
            ).withName("aabbs")
        ).withName("geometry"),
        JAVA_INT.withName("flags"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkGeometryNV");
    static final VarHandle const$5 = constants$724.const$4.varHandle(MemoryLayout.PathElement.groupElement("sType"));
}


