// Generated by jextract

package com.icuxika.kv.jextract.glfw;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$691 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$691() {}
    static final VarHandle const$0 = constants$690.const$0.varHandle(MemoryLayout.PathElement.groupElement("pPostSubpassSampleLocations"));
    static final StructLayout const$1 = MemoryLayout.structLayout(
        JAVA_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pNext"),
        JAVA_INT.withName("sampleLocationsEnable"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            JAVA_INT.withName("sType"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pNext"),
            JAVA_INT.withName("sampleLocationsPerPixel"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("width"),
                JAVA_INT.withName("height")
            ).withName("sampleLocationGridSize"),
            JAVA_INT.withName("sampleLocationsCount"),
            RuntimeHelper.POINTER.withName("pSampleLocations")
        ).withName("sampleLocationsInfo")
    ).withName("VkPipelineSampleLocationsStateCreateInfoEXT");
    static final VarHandle const$2 = constants$691.const$1.varHandle(MemoryLayout.PathElement.groupElement("sType"));
    static final VarHandle const$3 = constants$691.const$1.varHandle(MemoryLayout.PathElement.groupElement("pNext"));
    static final VarHandle const$4 = constants$691.const$1.varHandle(MemoryLayout.PathElement.groupElement("sampleLocationsEnable"));
    static final StructLayout const$5 = MemoryLayout.structLayout(
        JAVA_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pNext"),
        JAVA_INT.withName("sampleLocationSampleCounts"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("width"),
            JAVA_INT.withName("height")
        ).withName("maxSampleLocationGridSize"),
        MemoryLayout.sequenceLayout(2, JAVA_FLOAT).withName("sampleLocationCoordinateRange"),
        JAVA_INT.withName("sampleLocationSubPixelBits"),
        JAVA_INT.withName("variableSampleLocations"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkPhysicalDeviceSampleLocationsPropertiesEXT");
}


