// Generated by jextract

package com.icuxika.kv.jextract.glfw;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$475 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$475() {}
    static final VarHandle const$0 = constants$474.const$3.varHandle(MemoryLayout.PathElement.groupElement("videoUsageHints"));
    static final StructLayout const$1 = MemoryLayout.structLayout(
        JAVA_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pNext"),
        JAVA_INT.withName("flags"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("srcBuffer"),
        JAVA_LONG.withName("srcBufferOffset"),
        JAVA_LONG.withName("srcBufferRange"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("sType"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pNext"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("x"),
                JAVA_INT.withName("y")
            ).withName("codedOffset"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("width"),
                JAVA_INT.withName("height")
            ).withName("codedExtent"),
            JAVA_INT.withName("baseArrayLayer"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("imageViewBinding")
        ).withName("dstPictureResource"),
        RuntimeHelper.POINTER.withName("pSetupReferenceSlot"),
        JAVA_INT.withName("referenceSlotCount"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pReferenceSlots")
    ).withName("VkVideoDecodeInfoKHR");
    static final VarHandle const$2 = constants$475.const$1.varHandle(MemoryLayout.PathElement.groupElement("sType"));
    static final VarHandle const$3 = constants$475.const$1.varHandle(MemoryLayout.PathElement.groupElement("pNext"));
    static final VarHandle const$4 = constants$475.const$1.varHandle(MemoryLayout.PathElement.groupElement("flags"));
    static final VarHandle const$5 = constants$475.const$1.varHandle(MemoryLayout.PathElement.groupElement("srcBuffer"));
}


