// Generated by jextract

package com.icuxika.kv.jextract.glfw;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$491 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$491() {}
    static final VarHandle const$0 = constants$490.const$2.varHandle(MemoryLayout.PathElement.groupElement("pictureLayout"));
    static final StructLayout const$1 = MemoryLayout.structLayout(
        JAVA_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pNext"),
        JAVA_INT.withName("maxLevelIdc"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("x"),
            JAVA_INT.withName("y")
        ).withName("fieldOffsetGranularity"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkVideoDecodeH264CapabilitiesKHR");
    static final VarHandle const$2 = constants$491.const$1.varHandle(MemoryLayout.PathElement.groupElement("sType"));
    static final VarHandle const$3 = constants$491.const$1.varHandle(MemoryLayout.PathElement.groupElement("pNext"));
    static final VarHandle const$4 = constants$491.const$1.varHandle(MemoryLayout.PathElement.groupElement("maxLevelIdc"));
    static final StructLayout const$5 = MemoryLayout.structLayout(
        JAVA_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pNext"),
        JAVA_INT.withName("stdSPSCount"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pStdSPSs"),
        JAVA_INT.withName("stdPPSCount"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pStdPPSs")
    ).withName("VkVideoDecodeH264SessionParametersAddInfoKHR");
}


